tutorials/incompressible/wDissipationTempBlockageConcentrationResidenceSinkTauSimpleFoam/somethingElse/0/DT
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      DT;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField  uniform 0;


boundaryField
{
    centralInlet
    {
        type            zeroGradient;
    }
    leftInlet
    {
        type            zeroGradient;
    }
    rightInlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    defaultName
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
