tutorials/incompressible/wDissipationTempBlockageConcentrationResidenceSinkTauSimpleFoam/somethingElse/0/concentration
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      concentration;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 1 0 0 0 0];

internalField   uniform 1e-5;
//existing boundaries (ignore everything else and set defaultfaces to empty) ['', '    outlet\n', '    defaultName\n', '    Inlet_melt\n', '    Inlet_gas\n']
boundaryField
{
    wall
    {
        type            zeroGradient;
    }

    defaultName
    {
        type            zeroGradient;

    }

    outlet
    {
        type            zeroGradient;

    }
	
    leftInlet
    {
        type            fixedValue;
		value 			1e-12;
    }
	
    rightInlet
    {
        type            fixedValue;
		value 			1;
    }
	
	centralInlet
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
